{
    "id0": "The Buddha-Bar is a bar, restaurant, and hotel franchise created by French-Romanian restaurateur Raymond Vișan, with its original location having opened in Paris, France in 1996. The Buddha Bar \"soon became a reference among foreign yuppies and wealthy tourists visiting the city\", and \"has spawned numerous imitators\", becoming popular in",
    "id1": "part because of the DJ's choice of eclectic, avant-garde music. It became known internationally for issuing the Buddha Bar compilation albums, which are popular compilations of lounge, chill-out music and world music, also under the Buddha Bar brand, released by George V Records. Buddha Bar \"has made a name for",
    "id2": "itself with its Zen lounge music CDs and remains a hit – especially with tourists\". Locations have since been opened in a number of other countries, although not without controversy arising from the theme. == Theme == The original restaurant is a Buddha-themed \"upscale bar-restaurant with an orientalist 'lounge' ambience\"",
    "id3": "serving Asian cuisine, with a two-story dining area dominated by a large statue of Buddha, and an upstairs bar in the form of a large, ornate dragon. The theme was inspired by the discovery of the space to be used, an antique basement archive with a mezzanine, \"which suggested to",
    "id4": "the architects the idea of an oriental temple and its Buddha\".Buddha Bar venues have been opened in various other locations, including Marrakesh, Beirut, Belgrade, Dubai, Abu Dhabi, London, Manila, Mauritius, Baku, Tbilisi, Kyiv, Moscow, Saint Petersburg, Caracas, Mexico City, Monte Carlo, Prague, Mykonos and Santorini. Several locations have since closed.",
    "id5": "In June 2012, a Washington, D.C. location closed after two years of operations, having \"struggled after a poor critical reception\"; while a New York City location was forced to change its name before closing down and subsequently re-opening in another location under new ownership. == Compilation albums == Buddha Bar",
    "id6": "compilation albums have been issued since 1999."
}