{
    "id0": "Paris in the Belle Époque was a period in the history of the city between the years 1871 to 1914, from the beginning of the Third French Republic until the First World War. It saw the construction of the Eiffel Tower, the Paris Métro, the completion of the Paris Opera,",
    "id1": "and the beginning of the Basilica of Sacré-Cœur on Montmartre. Three lavish \"universal expositions\" in 1878, 1889, and 1900 brought millions of visitors to Paris to sample the latest innovations in commerce, art, and technology. Paris was the scene of the first public projection of a motion picture, and the",
    "id2": "birthplace of the Ballets Russes, Impressionism, and Modern Art. The expression Belle Époque (\"beautiful era\") came into use after the First World War; it was a nostalgic term for what seemed a simpler time of optimism, elegance, and progress. == Rebuilding after the Commune == After the violent end of",
    "id3": "the Paris Commune in May 1871, the city was governed by martial law under the strict surveillance of the national government. At the time, Paris was not actually the capital of France. The government and parliament had moved to Versailles in March 1871 once the Paris Commune took power, and",
    "id4": "they did not return to Paris until 1879, although the Senate returned earlier to its home in the Luxembourg Palace.The end of the Commune left the city's population deeply divided. Gustave Flaubert described the atmosphere in the city in early June 1871: \"One half of the population of Paris wants",
    "id5": "to strangle the other half, and the other half has the same idea; you can read it in the eyes of people passing by.\" This sentiment soon became secondary to the need to reconstruct the buildings that had been destroyed in the last days of the Commune. The Communards had",
    "id6": "burned the Hôtel de Ville (including all the city archives), the Tuileries Palace, the Palais de Justice, the Prefecture of Police, the Ministry of Finances, the Cour des Comptes, the State Council building at the Palais-Royal, and many others."
}