{
    "id0": "Nefertiti Bust-This replica of the bust of Nefertiti was created in the 1930s and is made of plaster and paint.This was only a sculptor's model never meant to be a work of art on its own.",
    "id1": "Nefertiti Bust-This bust of Nefertiti is a very rare replica one of only three made off of the original which is currently in the Egyptian Museum Berlin.",
    "id2": "Nefertiti Bust-Nefertiti as you can see lived up to her name which means 'The Beautiful One Has Arrived.' Her left eye is missing. This doesn't mean that she was blind in one eye and it doesn't mean that this was lost.",
    "id3": "Nefertiti Bust-The sculptors would take this model out to the site and use it to show what Nefertiti looked like rather than have Nefertiti sit there.",
    "id4": "Mummy from Usermontu's Coffin-This male mummy has long been an enigma. He does not display the traditional style of mummification of the time period of the coffin in which he was discovered. ",
    "id5": "Mummy from Usermontu's Coffin-A piece of adhered linen from his wrist dates to 400 BCE but thorough study has revealed he has a style of mummification pointing towards a much earlier era perhaps as far back as the New Kingdom beginning around 1570 BCE or maybe slightly later. ",
    "id6": "Mummy from Usermontu's Coffin-The discrepancies could be explained by the fact that when the tombs in the Valley of the Kings were robbed many mummies were rewrapped and hidden to protect them.",
    "id7": "Mummy from Usermontu's Coffin-The date of origin and familial lineage of this mummy is still under investigation.",
    "id8": "Baboon Mummy-Images and mummies of Djehuti (Thoth) were donated to temples in Ancient Egypt to honor the animal representing the god.",
    "id9": "Baboon Mummy-This figure is an anomaly.",
    "id10": "Baboon Mummy-There is no baboon in this mummy.",
    "id11": "Baboon Mummy-An x-ray (seen in the photo below) has revealed this figure is formed around an ancient ceramic jar.",
    "id12": "Ba Bird-Associated with the deity Sokar images like this frequently decorated funerary equipment in the tombs of Ancient Egypt.",
    "id13": "Ba Bird- These human-headed images represent the ba bird an aspect of the soul believed to fly out of the tomb.",
    "id14": "Ba Bird-Egyptologists suspect the ba was based on the bat which lived in the tombs and flew out at dusk.",
    "id15": "Ba Bird-This sculpture made of wood and paint is from the Late Period 712-332 BCE."
}