{
    "id0": "History The Rosicrucian Egyptian Museum began with one small artifact a Sekhmet (lion goddess) statue which stood on the desk of H. Spencer Lewis the founder of the Rosicrucian Order AMORC.",
    "id1": "AMORC which was founded in 1915 is a philosophical and educational public benefit (501c3) organization. Rosicrucian students study along with other subjects the wisdom of the ancient mystery schools including those of ancient Egypt.",
    "id2": "In the 1920s AMORC supported the excavations of the Egypt Exploration Society in Tell el-Amarna (Akhetaten) the city of the Pharaoh Akhnaton. In gratitude the Egypt Exploration Society donated several artifacts from their finds to AMORC.",
    "id3": "H. Spencer Lewis encouraged members to add to this collection which they did.",
    "id4": "In 1927 H. Spencer Lewis conceived of a public collection. He had glass cases built for the artifacts on the second floor of AMORC’s Administration building.",
    "id5": "In 1929 AMORC sponsored an initiatic journey through Egypt led by H. Spencer Lewis. This trip generated much enthusiasm which resulted in additional donations of artifacts and funds for the Museum. By 1932 the collection had outgrown its second-floor home so an additional building was constructed – the Rosicrucian Egyptian Oriental Museum.",
    "id6": "Ralph M. Lewis H. Spencer Lewis’s son and successor as Imperator of AMORC directed the growth of the Museum over the next few decades. By the early 1960s the Museum’s collection had grown to more than 2000 artifacts. A fully modern and larger museum facility was needed at this time. In 1965 Ralph Lewis personally led the research team that explored many tombs and temples in Egypt on which the new Museum building was modeled. In November 1966 the new Rosicrucian Egyptian Museum opened.",
    "id7": "Today the Museum with over 4000 artifacts houses the largest collection of authentic Ancient Egyptian artifacts on display in western North America. The Museum hosts more than 100000 guests per year including 26000 schoolchildren.",
    "id8": "The Museum highly values collaborative research and in recent years has worked on projects alongside many institutions including Stanford University Hospital UCLA NASA Ames Biocomputation Center the British Museum National Geographic’s Mummy Road Show and others.",
    "id9": "The Museum’s future looks promising with new exhibits tours and workshops with continuing research and scholarship and with a perennial commitment to education and service."
}