{
    "id0": "TitleDescription",
    "id1": "NameLink",
    "id2": "OriginHyrule",
    "id3": "SpeciesHylian",
    "id4": "OccupationHero, Various others depending on the game (e.g., train engineer, rancher)",
    "id5": "Associated PrincessZelda",
    "id6": "Main AntagonistGanon or Ganondorf",
    "id7": "Iconic OutfitGreen tunic and hat",
    "id8": "Main WeaponMaster Sword",
    "id9": "Main ShieldHylian Shield",
    "id10": "First AppearanceThe Legend of Zelda (1986)",
    "id11": "Latest AppearanceThe Legend of Zelda: Breath of the Wild (2017 as of my last update)",
    "id12": "CharacteristicSilent Protagonist",
    "id13": "Primary QuestSave Princess Zelda and Hyrule from evil",
    "id14": "IntroductionLink is the protagonist in Nintendo's beloved video game series The Legend of Zelda.\" Throughout various iterations of the game this iconic hero has embarked on multiple quests primarily to rescue Princess Zelda protect the land of Hyrule and thwart the evil plans of antagonists like Ganon and Ganondorf.\"",
    "id15": "Physical AppearanceLink is depicted as a young man with elvish features, including pointed ears, blue eyes, and blond hair. His garb traditionally consists of a green tunic, hat, and brown boots, signifying his hero status. The exact design and age of Link can vary from one game to another, but certain elements remain consistent, like the Master Sword and the Hylian Shield he often wields.",
    "id16": "Character Traits and PersonalityOne of the defining traits of Link is that he's usually a silent protagonist. This intentional design allows players to project themselves onto the character, immersing them more deeply in the game's world. Despite his silence, Link embodies bravery, determination, and a strong sense of duty. He has an unwavering moral compass and is always willing to risk everything to protect those he cares about.",
    "id17": "Origins and BackgroundIn many games, Link starts as an ordinary individual without knowledge of his heroic destiny. Depending on the game, he might be a ranch hand, a forest dweller, or even a train engineer. However, fate invariably draws him into grand adventures. The Triforce of Courage, a mystical relic, often chooses Link, setting him on his path to heroism.",
    "id18": "Adventures Across Time and SpaceOne of the unique aspects of the Legend of Zelda\" series is its approach to continuity. While some games directly relate to others some titles feature a Link from a different era or even an alternate reality. This flexibility in storytelling has led to games set in diverse environments: from the high seas in \"Wind Waker\" to the skies in \"Skyward Sword.\" \"Ocarina of Time for instance, is pivotal because it branches the timeline into three paths due to time-travel mechanics. This branching has allowed the Zelda series to explore various scenarios and outcomes for its characters.",
    "id19": "Skills and AbilitiesLink is more than just a swordsman. Over different games, he acquires a vast array of tools and skills that aid in his quests. From boomerangs, bows, and bombs to musical instruments with magical properties, his inventory is diverse. Additionally, Link often learns specific skills or abilities in each game, like transformation masks in Majora's Mask\" or the paraglider in \"Breath of the Wild.\"\"",
    "id20": "RelationshipsWhile Princess Zelda is often the character Link seeks to save, their relationship is multifaceted. In some games, they share deep bonds, either as close friends or implied romantic interests. Beyond Zelda, Link encounters numerous characters, each adding depth to the story and often aiding him in his quest. Characters like Navi the fairy, Midna from the Twilight Realm, or the Champions in Breath of the Wild\" showcase the rich tapestry of relationships Link forms\"",
    "id21": "WikiThe Legend of Zelda series Link has appeared as the protagonist of every game in The Legend of Zelda series and also appears in various spin-off games. Although the plot in each Zelda game varies, most center around him defeating Ganon with the Master Sword and rescuing Princess Zelda. During gameplay, he usually navigates through various dungeons, defeats monsters and solves puzzles before reaching the end of the game.[52]An overhead view of a young boy in a green tunic battling creaturesLink's first appearance in 2D form in The Legend of Zelda on the NES (1986)Link was introduced on the Nintendo Entertainment System (NES) in the original 1986 game release The Legend of Zelda. Due to the limited hardware of the era, he was rendered as a simple 8-bit 2D character within a flat environment viewed from a top-down perspective.[53] In his debut appearance, he is presented as a stubby character with brown hair wearing a green cap and tunic.[54] In the opening introduction, he meets an old man who offers him a sword and declares It's dangerous to go alone!\" Link is described as a \"young lad\" who saves Princess Zelda's elderly nursemaid Impa from Ganon's henchmen. He assumes the role of the hero and must rescue Princess Zelda and the kingdom of Hyrule from the evil wizard Ganon who has stolen the Triforce of Power. During the game the player controls Link as he explores 128 areas of Hyrule. Nine dungeons each contain a special item that gives him the ability to defeat that dungeon's boss; he must defeat them all before fighting Ganon.[55][39]In Zelda II: The Adventure of Link (1987) Link reappeared on the NES still as a basic 8-bit 2D character but as a slightly taller sprite wearing a similar green outfit.[56] The game differs from the previous title by switching between top-down exploration and side-scrolling action sequences.[57] Link's combat capability evolved with the ability to stab up and down with his sword while jumping. Experience points gained by defeating enemies enable his health and attack power to be levelled up. A series of magic spells also grant him special abilities such as extra defence.[54] The game involves defeating his doppelgänger Dark Link to claim the Triforce of Courage reunite the three pieces of the Triforce and awaken sleeping Zelda.[58] Dark Link would later reappear in Ocarina of Time The Oracle of Ages Twilight Princess and various other games.[59]A Link to the Past (1991) recreated Link in a 16-bit colour palette for the Super Nintendo Entertainment System. It presents the character with the unusual characteristic of having pink hair.[60] In contrast to the in-game sprite the game manual depicts Link as a tall blond character. Link's sprite was also designed to appear more expressive as he was given an animated hat and a face that turns red when pulling objects.[56] The game reverted to a top-down perspective and features items that upgrade Link's moves with extra abilities such as running and swimming.[54] The gameplay takes place across two parallel worlds: Hyrule and its mirror the Dark World. It introduced several recurring elements in the series including the hookshot and the Master Sword. Link's combat abilities were developed to be more complex. He was given the ability to move diagonally swing his sword in an arc and perform a spin attack that enabled multi-directional attacks.[61] His heart containers which featured in the first game were broken into pieces necessitating the player to locate them and upgrade his health in smaller increments.[62]Link's Awakening was released in 1993 for the Game Boy making it the first handheld title in the series. Link appeared in monochrome until the DX port brought the game to the Game Boy Color.[63] In place of Hyrule the game takes place on Koholint Island after Link is washed ashore. It features a combination of mostly top-down adventuring and some side-scrolling action sequences and was the first overhead game in which Link's move set includes the ability to jump. It also includes cutscenes that depict Link in an anime art style.[54] The inclusion of several non-Zelda characters such as Chain Chomp and Kirby were added for fun. Tezuka the director said \"It was like we were making a parody of Zelda\".[64][65] A 3D remake was released for the Nintendo Switch in 2019.[66]The Legend of Zelda: Ocarina of Time featured Link's first 3D rendering. Although the development team was new to 3D games assistant director Makoto Miyanaga recalled a \"passion for creating something new and unprecedented\".[67]Ocarina of Time (1998) which was released for the Nintendo 64 (N64) was the first 3D game in the Zelda series. It was a landmark game in terms of the graphics and gameplay and gave the player the experience of exploring a three-dimensional Hyrule. Link was depicted with blonde hair and his horse Epona was introduced as a mode of transport.[59] The plot's time shifts allow the player to control Link as a child carrying the Hylian Shield and a slingshot and later as an adult wielding heavier weapons.[56][68] His abilities were extensively developed to perform a variety of movements including a swipe stab roll dodge and dive. The game's Z-targeting system simulates sword fighting by enabling Link to lock on to enemies and circle around them in combat.[54] During his adventure he is accompanied by the fairy Navi who gives him hints about enemies and his surroundings.[69] In 2011 Ocarina of Time 3D was released as a remake of the original game for the Nintendo 3DS.[70]Link returned in 2000 with the release of Majora's Mask on the N64. It reused character and scenery models from Ocarina of Time but added some surreal effects and colours to create a darker entry than its predecessors. The game includes four main dungeons and various side quests. In the storyline Link appears as a child and must save the land of Termina from the evil of Majora's Mask which has drawn the moon into a decaying orbit threatening to crash into Termina's primary town Clock Town in three days. Link uses the Ocarina of Time to play the Song of Time which allows him to repeatedly travel back in time to relive those three days until he successfully prevents the disaster. During the game Link finds various magical masks that transform him into a Goron Deku Scrub or Zora and each grants him special abilities such as gliding swimming underwater and rolling.[71] In the final boss battle with Majora Link is transformed into Fierce Deity Link a dark adult version of himself with white eyes before finally reverting to his child form.[72] In 2015 Majora's Mask 3D revisited the game for the Nintendo 3DS.[73]Oracle of Seasons and Oracle of Ages are a pair of interconnected games released in 2001 for the Game Boy Color. The two games were outsourced to a developer named Flagship and were originally designed as a trio but the plan proved to be too complicated. Like Link's Awakening Link is controlled from a top-down perspective within a flat 2D game world.[74] The two games are interlinked with completion of one game unlocking secrets within the other. The plot involves Link being sent on a mission to the foreign lands of Holodrum and Labrynna in order to stop the disruption of the seasons by the General of Darkness Onox and the disruption of time by the Sorceress of Shadows Veran. Link's key tools for uncovering areas and fighting his enemies are the Rod of Seasons and his magic harp.[75]In 2002 Nintendo published A Link to the Past & Four Swords on the Game Boy Advance. Four Swords was an original title packaged together with the rereleased entry A Link to the Past. Diverging from the traditional single-player approach Four Swords was based on cooperative gameplay allowing four players to interact together by connecting four Game Boy Advance systems.[76] In Four Swords four Links of different colours appear each of which is controlled by a different player. The four versions of Link must then work together to complete the game's challenges.[77]Toon Link as depicted in promotional artwork for The Legend of Zelda: The Wind Waker HD dressed in the character's recognizable green clothes and holding the Wind Waker baton The Wind Waker was released in 2002 on the GameCube. It marked a radical change for the series by depicting Link and the game world in a cute childlike graphical style. He appears as a preteen cartoon character with a large head and huge eyes.[78] His facial expressions communicate a range of emotions.[54] The game involves exploring the islands that are dotted around the map to encounter characters and uncover dungeons.[79] Link's key tool is the titular Wind Waker a magical baton that enables him to manipulate the breeze as he crosses the Great Sea.[80] A sequel to The Wind Waker was planned but later abandoned in favor of Twilight Princess. Nintendo artist Satoru Takizawa explained the reason for this was that the sequel would have taken place in a land-based setting involving Link riding on horseback: \"But Link's proportions in Wind Waker weren't very well suited for riding on horseback; he was too short and an adult version of Toon Link did not seem appropriate either\".[81] In 2013 The Wind Waker HD revisited Link's voyage across the Great Sea on the Wii U.[82]Four Swords Adventures which was published for the GameCube in 2004 again reinterpreted traditional Zelda gameplay with a multiplayer approach. The plot centres on Link being split into four versions of himself by the Four Sword resulting in four Links of different colours. He must embark on a quest that involves rescuing seven princesses from an evil sorcerer. The game depicts the Links in a 16-bit top-down perspective and involves each player controlling one of the four Links to explore the game world and defeat enemies in order to complete each level.[83]The release of The Minish Cap in 2004 on the Game Boy Advance returned the series to a single-player format. Link appears as a child viewed from a top-down perspective and is tasked with saving his friend Princess Zelda. After a mysterious stranger arrives at a festival celebrating the coming of the Picori he destroys the sacred Picori Blade and turns Zelda to stone. During the game Link is accompanied by a magical talking cap named Ezlo who helps him on his quest and teaches him to shrink to the size of the Minish.[84]Twilight Princess (2006) was released on the GameCube and Wii and offers a darker adventure to previous entries in the series. The game features a more detailed depiction of a teenage Link who appears ready for battle wearing chainmail beneath his tunic. In the early part of the game he becomes trapped in the Twilight which transforms him into a wolf.[56] Throughout the game he is aided by Midna an imp-like creature who rides on his back and helps him on his quest. The game uses a variety of animal abilities for progression such as the ability to follow scents.[85] Twilight Princess aimed to provide a stark contrast to the cartoonish style of The Wind Waker presenting a game world drained of colour and a story with a more mature tone.[86] In 2016 Link appeared in Twilight Princess HD a remaster for the Wii U.[87]A direct sequel to The Wind Waker Phantom Hourglass was released in 2007 for the Nintendo DS. It follows Link as he embarks on a journey to save his friend Tetra. The game was designed to appeal to a wider audience with 3D cel-shaded graphics and a light-hearted tone.[88] It takes inspiration form the style and tone of The Wind Waker with Toon Link displaying various humorous expressions.[89] The game made use of the console's touchscreen functionality which enabled the player to control Link using a stylus instead of the traditional button controls.[90] Following on from Phantom Hourglass Spirit Tracks (2009) reintroduced Toon Link to the Nintendo DS. The game is a sequel to its predecessor and has a similar format but replaces sailing by boat with travelling by train. Link must explore four main map pieces return the power of the spirit tracks using the Spirit Flute and navigate the Spirit Tower the main labyrinth hub aided by the spirit of Zelda.[91] The gameplay also incorporates the mechanic of controlling both Link and Zelda in a series of cooperative puzzles and boss battles.[92] Skyward Sword was released on the Wii in 2011 and made use of the Wii Motion Plus as the central game mechanic giving the player the ability to control Link's sword using motion controls. The Wii Motion Plus is used to swipe his sword control a mechanical beetle and ride his loftwing through the skies.[93] The plot establishes a central timeline for the other games in the series and was designed to be an origin story for the Master Sword. It also involves a romantic relationship between Link and Zelda. It begins in Skyloft a land floating above the clouds until he is forced to descend to the surface after Zelda is kidnapped. He then travels between the two lands wielding the Goddess Sword a magical sword that holds a spirit named Fi who acts as his guide. During his journey Link imbues the Goddess Sword with three sacred flames which results in it being reforged into the Master Sword.[94] The game introduced Link's stamina meter for climbing surfaces and sprinting and the ability to craft materials to make new items.[54] Link also appears in Skyward Sword HD (2021) a remastered version of the game for the Nintendo Switch.[95][96] A Link Between Worlds was released in 2013 for the Nintendo 3DS and is a sequel to A Link to the Past. The plot revolves around a sorcerer named Yuga who has the ability to merge into walls and turn people into paintings. Link must foil his plan to revive Ganon. The storyline is set within the same world as A Link to the Past and was designed with a similar art style. Players are able to explore the two separate worlds of Hyrule and Lorule which are reminiscent of the contrasting worlds of light and dark in A Link to the Past. The game introduced the ability for Link to turn into a painting allowing him to walk along walls and switch between the two worlds.[97]Tri Force Heroes (2015) was the second original Zelda entry for the Nintendo 3DS and a departure from the series' tradition with a focus on a three-player cooperative campaign. Link appears alongside two companions that can be stacked to reach high places solve puzzles and defeat tall enemies.[98] The storyline revolves around the theme of fashion and is set in the realm of Hytopia where a witch has cursed Princess Styla to wear an ugly brown body suit. As a result the Hytopian king calls for adventurers to break the curse. The gameplay departs from the usual Zelda open-world structure and involves completing dungeons and collecting materials to fashion outfits that provide specific abilities.[99] Breath of the Wild was released on the Nintendo Switch and Wii U in 2017 and reinvented the franchise by creating a massive open world for Link to explore. He has the ability to climb most surfaces jump from structures and soar across the sky using a paraglider. He was designed to interact with the environment collect materials for cooking and react to cold and heat.[100] The complex nature of the environment also determined that his preexisting autojump functionality had to be developed into the ability to jump manually.[101] The game introduced significant changes to his design notably the absence of his signature green outfit. The player can instead dress Link in a variety of outfits and more emphasis is placed on using a bow as a prominent weapon.[102] The storyline centers around Link waking without his memories after a century in a stasis pod called the \"Shrine of Resurrection\" and discovering that Calamity Ganon has taken control of Hyrule Castle and that Hyrule has fallen into ruin.[103] Link appears in Tears of the Kingdom[104] a direct sequel to the previous game that is set in the same version of Hyrule.[105] Link loses his right arm after being attacked by a substance called Gloom and is saved by the spirit Rauru who grafts his own arm onto Link.[106] This new arm plays a major role as the source of his abilities.[107] It was designed to distinguish him from previous iterations as the theme of \"hands\" was chosen as a key recurring aspect of the game for creating items as well as cooperating with other characters.[108] Link's abilities include the Recall ability which rewinds an object's movement the Fuse ability which merges objects to create new weapons the Ultrahand ability which enables the construction of vehicles and the Ascend ability which enables Link to ascend through ceilings.[109] In the main quest line involving a boss fight with the leader of the Yiga Clan Master Kohga Link also obtains Autobuild which gives the ability to rebuild vehicles automatically without needing to manually build with Ultrahand.[110]\""
}